In [1]:
import pandas as pd

df = pd.read_csv("Ecommerce.csv")

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Id       52 non-null     int64
 1   Gender   52 non-null     object
 2   Country  52 non-null     object
 3   Amount   52 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.8+ KB

In [6]:
gc = df.groupby('Country')
gc.groups

{'KSA': [0, 1, 2, 4, 5, 9, 17, 33, 37, 39, 40, 41, 42, 44, 46, 47, 49, 50, 51], 'Kuwait': [3, 6, 11, 15, 16, 18, 19, 23, 26, 30, 31, 32, 34, 35, 36, 38, 43, 48], 'UAE': [7, 8, 10, 12, 13, 14, 20, 21, 22, 24, 25, 27, 28, 29, 45]}

In [7]:
gc = df.groupby(['Country','Gender'])
gc.groups

{('KSA', 'female'): [4, 9, 37, 39, 40, 41, 42, 44, 46, 47, 49, 50, 51], ('KSA', 'male'): [0, 1, 2, 5, 17, 33], ('Kuwait', 'female'): [3, 11, 18, 35, 36, 38, 43, 48], ('Kuwait', 'male'): [6, 15, 16, 19, 23, 26, 30, 31, 32, 34], ('UAE', 'female'): [10, 12, 14, 45], ('UAE', 'male'): [7, 8, 13, 20, 21, 22, 24, 25, 27, 28, 29]}

In [12]:
gc.get_group('KSA')

ValueError: must supply a tuple to get_group with multiple grouping keys

In [13]:
gc = df.groupby('Country')
# gc.groups
gc.get_group('KSA')

    Id  Gender Country  Amount
0    1    male     KSA    1500
1    2    male     KSA    2000
2    3    male     KSA    3000
4    5  female     KSA    1000
5    6    male     KSA    1500
9   10  female     KSA    1000
17  18    male     KSA    3000
33  34    male     KSA    2000
37  38  female     KSA    1000
39  40  female     KSA    1500
40  41  female     KSA    2000
41  42  female     KSA    1000
42  43  female     KSA    1500
44  45  female     KSA    3000
46  47  female     KSA    1000
47  48  female     KSA    1500
49  50  female     KSA    3000
50  51  female     KSA    1500
51  52  female     KSA    2000

In [17]:
gc = df.groupby(['Country'])['Id'].count()
gc

Country
KSA       19
Kuwait    18
UAE       15
Name: Id, dtype: int64

In [18]:
gc = df.groupby(['Country','Gender'])['Id'].count()
gc

Country  Gender
KSA      female    13
         male       6
Kuwait   female     8
         male      10
UAE      female     4
         male      11
Name: Id, dtype: int64

In [19]:
gc = df.groupby(['Country','Gender'])['Id'].mean()
gc

Country  Gender
KSA      female    39.384615
         male      10.666667
Kuwait   female    30.000000
         male      24.200000
UAE      female    21.250000
         male      21.363636
Name: Id, dtype: float64

In [21]:
gc = df.groupby(['Country']).agg(Mean_coumn =('Amount','mean'),Mean_std =('Amount','std'),Mean_sum =('Amount','sum'))
gc

          Mean_coumn    Mean_std  Mean_sum
Country
KSA      1789.473684  732.495534     34000
Kuwait   1666.666667  542.326145     30000
UAE      2033.333333  789.816133     30500

In [26]:
gc=gc.sort_values('Mean_sum',ascending=True)
gc

          Mean_coumn    Mean_std  Mean_sum
Country
Kuwait   1666.666667  542.326145     30000
UAE      2033.333333  789.816133     30500
KSA      1789.473684  732.495534     34000